app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "title", "password_digest") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Matthew"], ["email", "[FILTERED]"], ["created_at", "2025-11-18 01:06:45.330626"], ["updated_at", "2025-11-18 01:06:45.330626"], ["title", nil], ["password_digest", "[FILTERED]"]]
---
  def create
   @user=User.new(user_params)
   if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 31]]
---
  def destroy
    #@user = set_user  # Find the user by ID
    @user.destroy     # Delete the user